### Merging DataFrame

In [ ]:
import pandas as pd

In [ ]:
dict_movies = [
    {'movie_id': 1, 'name': 'One'},
    {'movie_id': 3, 'name': 'Three'},
    {'movie_id': 31, 'name': 'Thirty one'}
]

In [ ]:
movies = pd.DataFrame(dict_movies)

In [ ]:
movies

   movie_id        name
0         1         One
1         3       Three
2        31  Thirty one

In [ ]:
dict_ratings = [
    {'movie_id': 31, 'rating': 4.1},
    {'movie_id': 1, 'rating': 1.1},
    {'movie_id': 3, 'rating': 3.0}
]

In [ ]:
ratings = pd.DataFrame(dict_ratings)

In [ ]:
ratings

   movie_id  rating
0        31     4.1
1         1     1.1
2         3     3.0

In [ ]:
movies

   movie_id        name
0         1         One
1         3       Three
2        31  Thirty one

In [ ]:
ratings

   movie_id  rating
0        31     4.1
1         1     1.1
2         3     3.0

`movies` and `ratings` dataframe have the same `movie_id` column. Merge them

In [ ]:
movies.merge(ratings)

   movie_id        name  rating
0         1         One     1.1
1         3       Three     3.0
2        31  Thirty one     4.1